---
kind: method
id: M:Autodesk.Revit.DB.RuledSurface.GetSecondProfileCurve
source: html/ed774fa0-6b6b-bdb5-da2e-dba4b122d2a3.htm
---
# Autodesk.Revit.DB.RuledSurface.GetSecondProfileCurve Method

Returns a copy of the second profile curve if it is set.

## Syntax (C#)
```csharp
public Curve GetSecondProfileCurve()
```

## Returns
A copy of the second profile curve, if it exists. If a point was used to define the second profile, this function will return Nothing nullptr a null reference ( Nothing in Visual Basic) .